---
kind: method
id: M:Autodesk.Revit.DB.ViewNode.GetCameraInfo
source: html/6f289011-b656-49be-023b-b5c07493e3ac.htm
---
# Autodesk.Revit.DB.ViewNode.GetCameraInfo Method

Information about the observation point (the camera) of the view.

## Syntax (C#)
```csharp
public CameraInfo GetCameraInfo()
```

## Returns
An instance of CameraInfo or Nothing nullptr a null reference ( Nothing in Visual Basic) if there is no info associated with the view